# ElemDeletableInFamily Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ElemDeletableInFamily Property
ParameterTypeId Class See Also
---
"Deletable"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ElemDeletableInFamily { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ElemDeletableInFamily As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ElemDeletableInFamily {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace